
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>类加载机制 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="JVMBytesCodeEngine.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Foundational Java
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    JVM
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="ClassLoad.html">
            
                <a href="ClassLoad.html">
            
                    
                    类加载机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="JVMBytesCodeEngine.html">
            
                <a href="JVMBytesCodeEngine.html">
            
                    
                    JVM字节码执行引擎
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >类加载机制</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;">&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;</h1>
<h3 id="&#x521D;&#x59CB;&#x5316;">&#x521D;&#x59CB;&#x5316;</h3>
<p>&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x5728;&#x771F;&#x6B63;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;Java&#x5B57;&#x8282;&#x7801;&#x3002;<strong>&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x662F;&#x6267;&#x884C;&#x7C7B;&#x6784;&#x9020;&#x5668;<code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x6536;&#x96C6;&#x7C7B;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7C7B;&#x53D8;&#x91CF;&#x7684;&#x8D4B;&#x503C;&#x52A8;&#x4F5C;&#x548C;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x5408;&#x5E76;&#x4EA7;&#x751F;&#x7684;</strong>&#x3002;<br></p>
<h5 id="&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x7684;&#x53D8;&#x91CF;&#x8BBF;&#x95EE;">&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x7684;&#x53D8;&#x91CF;&#x8BBF;&#x95EE;</h5>
<p>&#x7F16;&#x8BD1;&#x5668;&#x6536;&#x96C6;&#x987A;&#x5E8F;&#x662F;&#x8BED;&#x53E5;&#x5728;&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x987A;&#x5E8F;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x4E2D;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x5230;&#x5B9A;&#x4E49;&#x5728;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x4E4B;&#x524D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B9A;&#x4E49;&#x5728;&#x5B83;&#x4E4B;&#x540E;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x524D;&#x9762;&#x7684;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x4E2D;<strong>&#x53EF;&#x4EE5;&#x8D4B;&#x503C;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;</strong>&#x3002;</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Test</span> </span>{
    <span class="hljs-keyword">static</span> {
        i = <span class="hljs-number">0</span>;                        <span class="hljs-comment">// &#x7ED9;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x7F16;&#x8BD1;&#x901A;&#x8FC7;</span>
        System.out.println(i);        <span class="hljs-comment">// &#x7F16;&#x8BD1;&#x5931;&#x8D25;&#xFF0C;&#x201C;&#x975E;&#x6CD5;&#x5411;&#x524D;&#x5F15;&#x7528;&#x201D;</span>
    }
    <span class="hljs-keyword">static</span> <span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span>;
}
</code></pre>
<p><code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#x4E0E;&#x7C7B;&#x7684;&#x6784;&#x9020;&#x5668;&#xFF08;&#x6216;&#x8005;&#x8BF4;&#x5B9E;&#x4F8B;&#x6784;&#x9020;&#x5668;<code>&lt;init&gt;()</code>&#x65B9;&#x6CD5;&#xFF09;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x5730;&#x8C03;&#x7528;&#x7236;&#x7C7B;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x4FDD;&#x8BC1;&#x5728;&#x5B50;&#x7C7B;&#x7684;<code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x4E4B;&#x524D;&#xFF0C;&#x7236;&#x7C7B;&#x7684;<code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x56E0;&#x6B64;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x88AB;&#x6267;&#x884C;&#x7684;<clinit>()&#x65B9;&#x6CD5;&#x7684;&#x7C7B;&#x80AF;&#x5B9A;&#x662F;<code>java.lang.Object</code>&#x3002;&#x800C;&#x4E14;&#x7236;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x8981;&#x4F18;&#x5148;&#x4E8E;&#x5B50;&#x7C7B;&#x7684;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x3002;<br></clinit></p>
<p><code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#x5BF9;&#x7C7B;&#x548C;&#x63A5;&#x53E3;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x4E0E;&#x7C7B;&#x53D8;&#x91CF;&#x7684;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x4E3A;&#x8FD9;&#x4E2A;&#x7C7B;&#x751F;&#x6210;<code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#x3002;
&#x63A5;&#x53E3;&#x4E2D;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#xFF0C;&#x4F46;&#x4EFB;&#x7136;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x63A5;&#x53E3;&#x4E0E;&#x7C7B;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;<strong>&#x6267;&#x884C;&#x63A5;&#x53E3;&#x7684;<code>&lt;clinit&gt;()</code>&#x4E0D;&#x9700;&#x8981;&#x5148;&#x6267;&#x884C;&#x7236;&#x63A5;&#x53E3;&#x7684;<code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;</strong>&#xFF0C;&#x63A5;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x7C7B;&#x5728;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x4E5F;&#x4E00;&#x6837;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#x63A5;&#x53E3;&#x7684;<code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#x3002;**&#x53EA;&#x6709;&#x5F53;&#x7236;&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x7236;&#x63A5;&#x53E3;&#x624D;&#x4F1A;&#x521D;&#x59CB;&#x5316;&#x3002;<br> </p>
<p>&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x53BB;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53BB;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;<code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x90FD;&#x9700;&#x8981;<strong>&#x963B;&#x585E;&#x7B49;&#x5F85;</strong>&#xFF0C;&#x76F4;&#x5230;&#x6D3B;&#x52A8;&#x7EBF;&#x7A0B;&#x6267;&#x884C;<code>&lt;clinit&gt;()</code>&#x65B9;&#x6CD5;&#x5B8C;&#x6BD5;&#x3002;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5524;&#x9192;&#x540E;&#x4E0D;&#x4F1A;&#x518D;&#x6B21;&#x8FDB;&#x5165;<clinit>()&#x65B9;&#x6CD5;&#x3002;
<strong>&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x53EA;&#x4F1A;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x6B21;&#x3002;</strong></clinit></p>
<h2 id="&#x7C7B;&#x52A0;&#x8F7D;&#x5668;">&#x7C7B;&#x52A0;&#x8F7D;&#x5668;</h2>
<p>&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x6A21;&#x5757;&#xFF0C;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#xFF1A;<code>&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5168;&#x9650;&#x5B9A;&#x57DF;&#x540D;&#x6765;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5B57;&#x8282;&#x6D41;</code>&#x3002;&#x5B83;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53C2;&#x4E0E;&#x8FDB;&#x6765;&#x7684;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x3002;<br></p>
<h5 id="1-&#x7C7B;&#x4E0E;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;">1. &#x7C7B;&#x4E0E;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;</h5>
<p>&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x7531;&#x52A0;&#x8F7D;&#x5B83;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x548C;&#x8FD9;&#x4E2A;&#x7C7B;&#x672C;&#x8EAB;&#x4E00;&#x540C;&#x786E;&#x7ACB;&#x5176;&#x5728;Java&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x7684;&#x552F;&#x4E00;&#x6027;&#xFF0C;*&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x90FD;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x7C7B;&#x540D;&#x79F0;&#x7A7A;&#x95F4;&#x3002;
&#x901A;&#x4FD7;&#x70B9;&#x8BB2;&#x5C31;&#x662F;&#xFF1A;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A;&#x7C7B;&#x662F;&#x5426;&#x201C;&#x76F8;&#x7B49;&#x201D;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x662F;&#x7531;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x624D;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x6765;&#x6E90;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;Class&#x6587;&#x4EF6;&#xFF0C;
&#x88AB;&#x540C;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x52A0;&#x8F7D;&#xFF0C;&#x53EA;&#x8981;&#x52A0;&#x8F7D;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x5C31;&#x5FC5;&#x5B9A;&#x4E0D;&#x76F8;&#x7B49;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x76F8;&#x7B49;&#x201D;&#x6307;&#x7684;&#x662F;&#x4EE3;&#x8868;&#x7C7B;&#x7684;Class&#x5BF9;&#x8C61;&#x7684;equals()&#x65B9;&#x6CD5;&#x3001;isAssignableFrom()&#x65B9;&#x6CD5;&#x3001;isInstance()&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E5F;&#x5305;&#x62EC;&#x4F7F;&#x7528;instanceof&#x5173;&#x952E;&#x5B57;&#x505A;&#x5BF9;&#x8C61;&#x6240;&#x5C5E;&#x5173;&#x7CFB;&#x5224;&#x5B9A;&#x7B49;&#x60C5;&#x51B5;&#x3002;</p>
</blockquote>
<h5 id="2-&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;">2. &#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;</h5>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x6536;&#x5230;&#x4E86;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x4E0D;&#x4F1A;&#x81EA;&#x5DF1;&#x53BB;&#x5C1D;&#x8BD5;&#x52A0;&#x8F7D;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x59D4;&#x6D3E;&#x7ED9;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53BB;&#x5B8C;&#x6210;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x90FD;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x56E0;&#x6B64;<strong>&#x6240;&#x6709;&#x7684;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#x6700;&#x7EC8;&#x90FD;&#x5E94;&#x8BE5;&#x4F20;&#x9001;&#x5230;&#x9876;&#x5C42;&#x7684;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E2D;</strong>&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x7236;&#x52A0;&#x8F7D;&#x5668;&#x53CD;&#x9988;&#x81EA;&#x5DF1;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#xFF08;&#x5B83;&#x7684;&#x641C;&#x7D22;&#x8303;&#x56F4;&#x4E2D;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x6240;&#x9700;&#x7684;&#x7C7B;&#xFF09;&#x65F6;&#xFF0C;&#x5B50;&#x52A0;&#x8F7D;&#x5668;&#x624D;&#x4F1A;&#x5C1D;&#x8BD5;&#x81EA;&#x5DF1;&#x53BB;&#x52A0;&#x8F7D;&#x3002;<br></p>
<p>&#x4ECE;&#x865A;&#x62DF;&#x673A;&#x89D2;&#x5EA6;&#x8BB2;&#xFF0C;&#x53EA;&#x5B58;&#x5728;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF1A;<br></p>
<ol>
<li>&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08;<code>Bootstrap ClassLoader</code>&#xFF09;&#xFF1A;&#x5B83;&#x662F;&#x865A;&#x62DF;&#x673A;&#x672C;&#x8EAB;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5728;HotSpot&#x4E2D;&#xFF0C;&#x7531;C++&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x3002;</li>
<li>&#x6240;&#x6709;&#x7684;&#x5176;&#x4ED6;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF1A;&#x72EC;&#x7ACB;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x5916;&#x90E8;&#xFF0C;&#x90FD;&#x7EE7;&#x627F;&#x81EA;&#x62BD;&#x8C61;&#x7C7B;<code>java.lang.ClassLoader</code></li>
</ol>
<h6 id="&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x7684;&#x7834;&#x574F;">&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x7684;&#x7834;&#x574F;</h6>
<p>&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x89E3;&#x51B3;&#x4E86;&#x5404;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x7EDF;&#x4E00;&#x95EE;&#x9898;&#xFF08;&#x6700;&#x57FA;&#x7840;&#x7684;&#x4EE3;&#x7801;&#x7531;Bootstrap&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D;&#xFF09;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x57FA;&#x7840;&#x7C7B;&#x53C8;&#x8981;&#x8C03;&#x7528;&#x56DE;&#x7528;&#x6237;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x5C31;&#x5FC5;&#x987B;&#x5F97;&#x60F3;&#x522B;&#x7684;&#x529E;&#x6CD5;&#x4E86;&#x3002;</p>
<ol>
<li>&#x6BD4;&#x5982;Java&#x6709;&#x4E9B;&#x670D;&#x52A1;&#x9700;&#x8981;&#x8C03;&#x7528;&#x7531;&#x72EC;&#x7ACB;&#x5382;&#x5546;&#x5B9E;&#x73B0;&#x5E76;&#x90E8;&#x7F72;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;ClassPath&#x4E0B;&#x7684;SPI&#xFF08;<code>Service Provider Interface</code>&#xFF09;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E0D;&#x53EF;&#x80FD;&#x201C;&#x8BA4;&#x8BC6;&#x201D;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x3002;<blockquote>
<p>JNDI&#x3001;JDBC<br>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x7EBF;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08;<code>Thread Context ClassLoader</code>&#xFF09;&#x3002;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x9700;&#x8981;&#x7684;SPI&#x4EE3;&#x7801;&#xFF0C;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4F1A;&#x8BF7;&#x6C42;&#x5B50;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53BB;&#x5B8C;&#x6210;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x52A8;&#x4F5C;&#x3002;</p>
</blockquote>
</li>
<li>OSGi&#x4EE3;&#x7801;&#x70ED;&#x66FF;&#x6362;&#xFF1A;&#x6BCF;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#xFF08;OSGi&#x4E2D;&#x79F0;&#x4E3A;Bundle&#xFF09;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x5728;OSGi&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E0D;&#x518D;&#x662F;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x662F;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#x4E3A;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x7F51;&#x72B6;&#x7ED3;&#x6784;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="JVMBytesCodeEngine.html" class="navigation navigation-next navigation-unique" aria-label="Next page: JVM字节码执行引擎">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"类加载机制","level":"1.2.1","depth":2,"next":{"title":"JVM字节码执行引擎","level":"1.2.2","depth":2,"path":"jvm/JVMBytesCodeEngine.md","ref":"jvm/JVMBytesCodeEngine.md","articles":[]},"previous":{"title":"JVM","level":"1.2","depth":1,"ref":"","articles":[{"title":"类加载机制","level":"1.2.1","depth":2,"path":"jvm/ClassLoad.md","ref":"jvm/ClassLoad.md","articles":[]},{"title":"JVM字节码执行引擎","level":"1.2.2","depth":2,"path":"jvm/JVMBytesCodeEngine.md","ref":"jvm/JVMBytesCodeEngine.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"jvm/ClassLoad.md","mtime":"2019-09-02T13:33:57.097Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-09T14:24:26.379Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

