
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>JVM字节码执行引擎 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="ClassLoad.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Foundational Java
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    JVM
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="ClassLoad.html">
            
                <a href="ClassLoad.html">
            
                    
                    类加载机制
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="JVMBytesCodeEngine.html">
            
                <a href="JVMBytesCodeEngine.html">
            
                    
                    JVM字节码执行引擎
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >JVM字节码执行引擎</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="jvm&#x5B57;&#x8282;&#x7801;&#x6267;&#x884C;&#x5F15;&#x64CE;">JVM&#x5B57;&#x8282;&#x7801;&#x6267;&#x884C;&#x5F15;&#x64CE;</h1>
<blockquote>
<p>&#x8DE8;&#x5E73;&#x53F0;&#xFF0C;&#x5916;&#x89C2;&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x8F93;&#x5165;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x5B57;&#x8282;&#x7801;&#x89E3;&#x6790;&#xFF0C;&#x8F93;&#x51FA;&#x6267;&#x884C;&#x7ED3;&#x679C;  </p>
<ol>
<li>&#x89E3;&#x91CA;&#x6267;&#x884C;&#xFF08;&#x901A;&#x8FC7;&#x89E3;&#x91CA;&#x5668;&#xFF09;</li>
<li>&#x7F16;&#x8BD1;&#x6267;&#x884C;&#xFF08;&#x901A;&#x8FC7;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x4EA7;&#x751F;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x6267;&#x884C;&#xFF09;</li>
</ol>
</blockquote>
<h3 id="&#x4E00;-&#x6808;&#x5E27;">&#x4E00;. &#x6808;&#x5E27;</h3>
<p>&#x6808;&#x5E27;&#xFF08;Stack Frame&#xFF09;&#x662F;&#x7528;&#x4E8E;&#x652F;&#x6301;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x884C;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x548C;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x4E2D;&#x865A;&#x62DF;&#x673A;&#x6808;&#x7684;&#x6808;&#x5143;&#x7D20;&#x3002;
&#x5728;&#x6D3B;&#x52A8;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4F4D;&#x4E8E;&#x6808;&#x9876;&#x7684;&#x6808;&#x5E27;&#x624D;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x8FD0;&#x884C;&#x7684;&#x6240;&#x6709;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x90FD;&#x53EA;&#x9488;&#x5BF9;&#x5F53;&#x524D;&#x6808;&#x5E27;&#xFF08;&#x6808;&#x9876;&#x7684;&#xFF09;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;</p>
<blockquote>
<p>&#x865A;&#x62DF;&#x673A;&#x6808;&#x662F;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x6570;&#x636E;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF1B;<br>&#x5728;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6808;&#x5E27;&#x4E2D;&#x9700;&#x8981;&#x591A;&#x5927;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#xFF0C;&#x591A;&#x6DF1;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x90FD;&#x5DF2;&#x7ECF;&#x5B8C;&#x5168;&#x786E;&#x5B9A;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x5199;&#x5230;&#x4E86;&#x65B9;&#x6CD5;&#x8868;&#x7684;Code&#x5C5E;&#x6027;&#x5F53;&#x4E2D;&#xFF0C;
&#x56E0;&#x6B64;<strong>&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#x9700;&#x8981;&#x5206;&#x914D;&#x591A;&#x5C11;&#x5185;&#x5B58;&#xFF0C;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x8FD0;&#x884C;&#x671F;&#x53D8;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x4EC5;&#x4EC5;&#x53D6;&#x51B3;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x865A;&#x62DF;&#x673A;&#x5B9E;&#x73B0;</strong>&#x3002;</p>
</blockquote>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x6709;&#xFF1A;<br></p>
<h5 id="1-&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;">1. &#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;:<br></h5>
<p>&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x65B9;&#x6CD5;&#x53C2;&#x6570;&#x548C;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x5B9A;&#x4E49;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5B83;&#x4EE5;&#x53D8;&#x91CF;&#x69FD;&#xFF08;<code>Slot</code>&#xFF09;&#x4E3A;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x4E00;&#x4E2A;Slot&#x5360;32&#x4F4D;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x6307;&#x51FA;
<strong>&#x6BCF;&#x4E00;&#x4E2A;Slot&#x5E94;&#x8BE5;&#x80FD;&#x653E;&#x4E0B;boolean&#x3001;byte&#x3001;char&#x3001;short&#x3001;int&#x3001;float&#x3001;reference&#x6216;returnAddress&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;</strong></p>
<p>&#x5BF9;&#x4E8E;&#x4E24;&#x4E2A;&#x76F8;&#x90BB;&#x7684;&#x5171;&#x540C;&#x5B58;&#x653E;&#x4E00;&#x4E2A;64&#x4F4D;&#x6570;&#x636E;&#xFF08;long&#x3001;double&#xFF09;&#x7684;&#x4E24;&#x4E2A;Slot&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x4E0D;&#x5141;&#x8BB8;&#x91C7;&#x7528;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x5355;&#x72EC;&#x8BBF;&#x95EE;&#x5176;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x3002;0&#x53F7;Slot&#x9ED8;&#x8BA4;&#x662F;&#x7528;&#x4E8E;&#x4F20;&#x9012;
&#x65B9;&#x6CD5;&#x6240;&#x5C5E;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x5728;&#x65B9;&#x6CD5;&#x4E2D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5173;&#x952E;&#x5B57;this&#x6765;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x9690;&#x542B;&#x7684;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x8BF4;&#x4E0B;reference&#x7684;&#x4F5C;&#x7528;&#xFF1A;<br></p>
<ol>
<li>&#x865A;&#x62DF;&#x673A;&#x5E94;&#x8BE5;&#x80FD;&#x4ECE;&#x6B64;&#x5F15;&#x7528;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x5730;&#x67E5;&#x627E;&#x5230;&#x5BF9;&#x8C61;<strong>&#x5728;Java&#x5806;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;&#x7D22;&#x5F15;</strong>&#x3002;</li>
<li>&#x865A;&#x62DF;&#x673A;&#x5E94;&#x8BE5;&#x80FD;&#x4ECE;&#x6B64;&#x5F15;&#x7528;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x5730;&#x67E5;&#x627E;&#x5230;&#x5BF9;&#x8C61;<strong>&#x6240;&#x5C5E;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5728;&#x65B9;&#x6CD5;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;</strong>&#x3002;  </li>
</ol>
<p>&#x6700;&#x540E;&#x4E00;&#x79CD;returnAddress&#x73B0;&#x5728;&#x57FA;&#x672C;&#x4E0D;&#x7528;&#x4E86;&#xFF0C;&#x5B83;&#x662F;&#x4E3A;jsr&#x3001;jsr_w&#x3001;&#x548C;ret&#x670D;&#x52A1;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x51E0;&#x6761;&#x6307;&#x4EE4;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x4E0D;&#x7528;&#x4E86;&#x3002;</p>
<h6 id="slot&#x91CD;&#x7528;&#x4E0E;gc&#x7684;&#x5173;&#x7CFB;">Slot&#x91CD;&#x7528;&#x4E0E;GC&#x7684;&#x5173;&#x7CFB;</h6>
<p>&#x65B9;&#x6CD5;&#x4F53;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x4F5C;&#x7528;&#x57DF;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x8986;&#x76D6;&#x6574;&#x4E2A;&#x65B9;&#x6CD5;&#x4F53;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B57;&#x8282;&#x7801;PC&#x8BA1;&#x6570;&#x5668;&#x7684;&#x503C;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x4E86;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x5BF9;&#x5E94;&#x7684;Slot&#x5C31;&#x53EF;&#x4EE5;&#x4EA4;&#x7ED9;&#x5176;&#x4ED6;&#x53D8;&#x91CF;&#x4F7F;&#x7528;<br>
&#x5728;&#x65B9;&#x6CD5;&#x4F53;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x80FD;&#x5426;&#x88AB;&#x56DE;&#x6536;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#x662F;&#xFF1A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x4E2D;&#x7684;Slot&#x662F;&#x5426;&#x8FD8;&#x5B58;&#x5728;&#x8005;&#x5173;&#x4E8E;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x3002;</p>
<p>&#x7EFC;&#x5408;&#x524D;&#x9762;&#x4E24;&#x53E5;&#x8BDD;&#xFF0C;&#x5373;&#x4F7F;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x8D85;&#x51FA;&#x4E86;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x65B0;&#x503C;&#x6765;&#x4F7F;&#x7528;&#x6389;&#x5B83;&#x7684;&#x8FD9;&#x4E2A;Slot&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5F15;&#x7528;&#x5C31;&#x4E00;&#x76F4;&#x5728;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x91CC;&#xFF0C;&#x662F;&#x4E0D;&#x4F1A;&#x88AB;GC&#x7684;&#x3002;</p>
<pre><code class="lang-java"><span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">()</span><span class="hljs-params">(String[] args)</span> </span>{
    {
        <span class="hljs-keyword">byte</span>[] placeholder = <span class="hljs-keyword">new</span> <span class="hljs-keyword">byte</span>[<span class="hljs-number">64</span> * <span class="hljs-number">1024</span> * <span class="hljs-number">1024</span>];
    }
    <span class="hljs-keyword">int</span> a = <span class="hljs-number">0</span>;              <span class="hljs-comment">// &#x8FD9;&#x91CC;placeholder&#x5DF2;&#x7ECF;&#x79BB;&#x5F00;&#x4E86;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x65B0;&#x503C;&#x6765;&#x5360;&#x4F4D;&#xFF0C;&#x5B83;&#x5C31;&#x65E0;&#x6CD5;&#x88AB;&#x56DE;&#x6536;</span>
    <span class="hljs-comment">// placeholder = null   // &#x4E5F;&#x53EF;&#x4EE5;</span>
    System.gc();
}
</code></pre>
<p>&#x6709;&#x4E00;&#x6761;&#x7F16;&#x7801;&#x89C4;&#x5219;&#x662F;&#x8FD9;&#x6837;&#x8BB2;&#x7684;&#xFF1A;<code>&#x4E0D;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x5E94;&#x624B;&#x52A8;&#x8D4B;&#x503C;&#x4E3A;null</code>&#x3002;&#x4F46;&#x8D4B;&#x503C;null&#x7684;&#x64CD;&#x4F5C;&#x5BB9;&#x6613;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x6389;&#xFF0C;&#x800C;&#x4E14;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x6B65;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x4E5F;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x5904;&#x7406;&#x56DE;&#x6536;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h5 id="2-&#x64CD;&#x4F5C;&#x6570;&#x6808;">2. &#x64CD;&#x4F5C;&#x6570;&#x6808;</h5>
<p>&#x540C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x4E00;&#x6837;&#xFF0C;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x7684;&#x6700;&#x5927;&#x6DF1;&#x5EA6;&#x4E5F;&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x5199;&#x5165;&#x5230;Code&#x5C5E;&#x6027;&#x7684;<code>max_stacks</code>&#x6570;&#x636E;&#x9879;&#x4E2D;&#x3002;Java&#x201C;&#x57FA;&#x4E8E;&#x6808;&#x7684;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x201D;&#x4E2D;&#x7684;<strong>&#x6808;</strong>&#x6307;&#x7684;&#x5C31;&#x662F;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x3002;</p>
<blockquote>
<p>&#x6808;&#x5E27;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x90FD;&#x662F;&#x6808;&#x7ED3;&#x6784;&#xFF0C;&#x4E0D;&#x8981;&#x641E;&#x6DF7;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x7C7B;&#x6821;&#x9A8C;&#x9636;&#x6BB5;&#x7684;&#x6570;&#x636E;&#x6D41;&#x5206;&#x6790;&#xFF0C;&#x4F1A;&#x9A8C;&#x8BC1;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E00;&#x5B9A;&#x4E0E;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x7684;&#x5E8F;&#x5217;&#x4E25;&#x683C;&#x5339;&#x914D;&#x3002;</p>
<p>&#x5728;&#x6982;&#x5FF5;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x6808;&#x5E27;&#x4F5C;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x6808;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x662F;&#x5B8C;&#x5168;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x4F46;&#x5927;&#x591A;&#x6570;&#x865A;&#x62DF;&#x673A;&#x7684;&#x5B9E;&#x73B0;&#x91CC;&#x4F1A;&#x4E0B;&#x9762;&#x6808;&#x5E27;&#x7684;&#x90E8;&#x5206;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x4E0E;&#x4E0A;&#x9762;&#x6808;&#x5E27;&#x7684;&#x90E8;&#x5206;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x91CD;&#x53E0;&#x5728;
&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x6267;&#x884C;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5171;&#x7528;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x636E;&#xFF0C;&#x65E0;&#x9700;&#x989D;&#x5916;&#x7684;&#x53C2;&#x6570;&#x590D;&#x5236;&#x4F20;&#x9012;&#x3002;</p>
<h5 id="3-&#x52A8;&#x6001;&#x94FE;&#x63A5;">3. &#x52A8;&#x6001;&#x94FE;&#x63A5;</h5>
<p>&#x6BCF;&#x4E2A;&#x6808;&#x5E27;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x8BE5;&#x6808;&#x5E27;&#x6240;&#x5C5E;&#x65B9;&#x6CD5;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x6301;&#x6709;&#x8FD9;&#x4E2A;&#x5F15;&#x7528;&#x662F;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x52A8;&#x6001;&#x8FDE;&#x63A5;&#x3002;</p>
<h5 id="4-&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x5730;&#x5740;">4. &#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x5730;&#x5740;</h5>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x540E;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x9000;&#x51FA;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;<br></p>
<ol>
<li>&#x6B63;&#x5E38;&#x5B8C;&#x6210;&#x51FA;&#x53E3;&#xFF1A;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x9047;&#x5230;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7684;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#xFF0C;&#x6B64;&#x65F6;&#x8C03;&#x7528;&#x8005;&#x7684;PC&#x8BA1;&#x6570;&#x5668;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#xFF0C;&#x6808;&#x5E27;&#x4E2D;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x4FDD;&#x5B58;&#x8FD9;&#x4E2A;&#x503C;</li>
<li>&#x5F02;&#x5E38;&#x5B8C;&#x6210;&#x51FA;&#x53E3;&#xFF1A;&#x5728;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x9047;&#x5230;&#x4E86;&#x5F02;&#x5E38;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#x6CA1;&#x6709;&#x5728;&#x65B9;&#x6CD5;&#x4F53;&#x5185;&#x5F97;&#x5230;&#x5904;&#x7406;<br>
&#x65E0;&#x8BBA;&#x662F;Java&#x865A;&#x62DF;&#x673A;&#x5185;&#x90E8;&#x4EA7;&#x751F;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x8FD8;&#x662F;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;athrow&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x4EA7;&#x751F;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x672C;&#x65B9;&#x6CD5;&#x7684;<strong>&#x5F02;&#x5E38;&#x8868;</strong>&#x5185;&#x6CA1;&#x6709;&#x641C;&#x7D22;&#x5230;&#x5339;&#x914D;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x65B9;&#x6CD5;&#x9000;&#x51FA;&#x3002;
<strong>&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x91C7;&#x7528;&#x5F02;&#x5E38;&#x5B8C;&#x6210;&#x51FA;&#x53E3;&#x7684;&#x65B9;&#x5F0F;&#x9000;&#x51FA;&#xFF0C;&#x662F;&#x4E0D;&#x4F1A;&#x7ED9;&#x5B83;&#x7684;&#x4E0A;&#x5C42;&#x8C03;&#x7528;&#x8005;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x8FD4;&#x56DE;&#x503C;&#x7684;</strong></li>
</ol>
<p>&#x65B9;&#x6CD5;&#x9000;&#x51FA;&#x7684;&#x8FC7;&#x7A0B;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x7B49;&#x540C;&#x4E8E;&#x628A;&#x5F53;&#x524D;&#x6808;&#x5E27;&#x51FA;&#x6808;&#xFF0C;&#x56E0;&#x6B64;&#x9000;&#x51FA;&#x65F6;&#x53EF;&#x80FD;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x6709;&#xFF1A;&#x6062;&#x590D;&#x4E0A;&#x5C42;&#x65B9;&#x6CD5;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#xFF0C;&#x628A;&#x8FD4;&#x56DE;&#x503C;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x538B;&#x5165;&#x8C03;&#x7528;&#x8005;&#x6808;&#x5E27;&#x7684;
&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x4E2D;&#xFF0C;&#x8C03;&#x6574;PC&#x8BA1;&#x6570;&#x5668;&#x7684;&#x503C;&#x4EE5;&#x6307;&#x5411;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x6307;&#x4EE4;&#x540E;&#x9762;&#x7684;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x3002;</p>
<h3 id="&#x4E8C;-&#x65B9;&#x6CD5;&#x8C03;&#x7528;">&#x4E8C;. &#x65B9;&#x6CD5;&#x8C03;&#x7528;</h3>
<p>&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x4E0D;&#x7B49;&#x540C;&#x4E8E;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#xFF0C;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x9636;&#x6BB5;&#x552F;&#x4E00;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x662F;<strong>&#x786E;&#x5B9A;&#x88AB;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x7684;&#x7248;&#x672C;&#xFF08;&#x5373;&#x8C03;&#x7528;&#x54EA;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF09;</strong>&#xFF0C;&#x6682;&#x65F6;&#x8FD8;&#x4E0D;&#x6D89;&#x53CA;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x7684;&#x5177;&#x4F53;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x3002;</p>
<blockquote>
<p>Java&#x5929;&#x751F;&#x52A8;&#x6001;&#x7684;&#x7279;&#x6027;&#xFF1A;&#x4E00;&#x5207;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x5728;Class&#x6587;&#x4EF6;&#x91CC;&#x9762;&#x5B58;&#x50A8;&#x7684;&#x90FD;&#x53EA;&#x662F;<strong>&#x7B26;&#x53F7;&#x5F15;&#x7528;</strong>&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x65B9;&#x6CD5;&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x65F6;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x7684;&#x5165;&#x53E3;&#x5730;&#x5740;&#xFF08;&#x76F8;&#x5F53;&#x4E8E;&#x4E4B;&#x524D;&#x8BF4;&#x7684;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#xFF09;&#x3002;
Java&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x9700;&#x8981;&#x5728;<strong>&#x7C7B;&#x52A0;&#x8F7D;&#x671F;&#x95F4;</strong>&#xFF0C;&#x751A;&#x81F3;&#x5230;<strong>&#x8FD0;&#x884C;&#x671F;&#x95F4;</strong>&#x624D;&#x80FD;&#x786E;&#x5B9A;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x7684;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x3002;</p>
</blockquote>
<h5 id="1-&#x89E3;&#x6790;">1. &#x89E3;&#x6790;</h5>
<p>&#x5728;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x89E3;&#x6790;&#x9636;&#x6BB5;&#xFF0C;&#x4F1A;&#x5C06;&#x4E00;&#x90E8;&#x5206;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x8F6C;&#x5316;&#x4E3A;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x79CD;&#x89E3;&#x6790;&#x80FD;&#x6210;&#x7ACB;&#x6709;&#x4E2A;&#x524D;&#x63D0;&#xFF08;<code>&#x7F16;&#x8BD1;&#x671F;&#x53EF;&#x77E5;&#xFF0C;&#x8FD0;&#x884C;&#x671F;&#x4E0D;&#x53D8;</code>)&#xFF1A;</p>
<ol>
<li>&#x65B9;&#x6CD5;&#x5728;&#x7A0B;&#x5E8F;&#x771F;&#x6B63;&#x53EF;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x786E;&#x5B9A;&#x7684;&#x8C03;&#x7528;&#x7248;&#x672C;&#x3002;</li>
<li>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x7248;&#x672C;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3002;</li>
</ol>
<p>&#x7B26;&#x5408;&#x4E0A;&#x8FF0;&#x8981;&#x6C42;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x5305;&#x62EC;<code>&#x9759;&#x6001;&#x65B9;&#x6CD5;</code>&#x548C;<code>&#x79C1;&#x6709;&#x65B9;&#x6CD5;</code>&#x4E24;&#x5927;&#x7C7B;&#xFF0C;&#x524D;&#x8005;&#x4E0E;&#x7C7B;&#x578B;&#x76F4;&#x63A5;&#x5173;&#x8054;&#xFF0C;&#x540E;&#x8005;&#x5728;&#x5916;&#x90E8;&#x4E0D;&#x53EF;&#x8BBF;&#x95EE;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x5404;&#x81EA;&#x7684;&#x7279;&#x6027;&#x51B3;&#x5B9A;&#x4E86;&#x5B83;&#x4EEC;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x901A;&#x8FC7;&#x7EE7;&#x627F;&#x6216;
&#x522B;&#x7684;&#x65B9;&#x5F0F;&#x91CD;&#x5199;&#x5176;&#x4ED6;&#x7248;&#x672C;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x90FD;&#x9002;&#x5408;&#x5728;&#x7C7B;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x3002;&#x53E6;&#x5916;&#x8FD8;&#x6709;<code>&#x5B9E;&#x4F8B;&#x6784;&#x9020;&#x5668;</code>&#x548C;<code>&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#xFF08;&#x672A;&#x91CD;&#x5199;&#x7684;&#x6216;super&#xFF09;</code>&#x4E5F;&#x7B26;&#x5408;&#x4E0A;&#x8FF0;&#x8981;&#x6C42;&#x3002;&#x8FD9;&#x56DB;&#x7C7B;&#x79F0;&#x4E3A;<strong>&#x975E;&#x865A;&#x65B9;&#x6CD5;</strong>&#x3002;<br></p>
<blockquote>
<p>&#x975E;&#x865A;&#x65B9;&#x6CD5;&#x8FD8;&#x5305;&#x62EC;final&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x7531;invokevirtual&#x6307;&#x4EE4;&#x6765;&#x8C03;&#x7528;&#x7684;&#x3002;</p>
</blockquote>
<p><strong>&#x89E3;&#x6790;&#x8C03;&#x7528;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x5C31;&#x5B8C;&#x5168;&#x786E;&#x5B9A;&#xFF0C;&#x5728;&#x7C7B;&#x88C5;&#x8F7D;&#x7684;&#x89E3;&#x6790;&#x9636;&#x6BB5;&#x5C31;&#x4F1A;&#x628A;&#x6D89;&#x53CA;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x5168;&#x90E8;&#x8F6C;&#x5316;&#x4E3A;&#x53EF;&#x786E;&#x5B9A;&#x7684;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#xFF0C;&#x4E0D;&#x4F1A;&#x5EF6;&#x8FDF;&#x5230;&#x8FD0;&#x884C;&#x671F;&#x518D;&#x53BB;&#x5B8C;&#x6210;</strong></p>
<p>Java&#x865A;&#x62DF;&#x673A;&#x63D0;&#x4F9B;&#x4E86;5&#x6761;&#x8C03;&#x7528;&#x5B57;&#x8282;&#x7801;&#x7684;&#x6307;&#x4EE4;&#xFF1A;<br></p>
<ol>
<li>invokestatic:     &#x8C03;&#x7528;&#x9759;&#x6001;&#x65B9;&#x6CD5;</li>
<li>invokespecial:    &#x8C03;&#x7528;&#x5B9E;&#x4F8B;&#x6784;&#x9020;&#x5668;<code>&lt;init&gt;()</code>&#x65B9;&#x6CD5;&#x3001;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x548C;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;</li>
<li>invokevirtual:    &#x8C03;&#x7528;&#x6240;&#x6709;&#x7684;&#x865A;&#x65B9;&#x6CD5;&#xFF08;<code>&#x9664;&#x53BB;&#x975E;&#x865A;&#x65B9;&#x6CD5;&#x548C;final&#x65B9;&#x6CD5;&#x4E4B;&#x5916;&#x7684;&#x65B9;&#x6CD5;</code>&#xFF09;</li>
<li>invokeinterface:  &#x8C03;&#x7528;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#xFF0C;&#x4F1A;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x518D;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x6B64;&#x63A5;&#x53E3;&#x7684;&#x5BF9;&#x8C61;</li>
<li>invokedynamic:    &#x5148;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x52A8;&#x6001;&#x89E3;&#x6790;&#x51FA;&#x8C03;&#x7528;&#x70B9;&#x9650;&#x5B9A;&#x7B26;&#x6240;&#x5F15;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6267;&#x884C;&#x8BE5;&#x65B9;&#x6CD5;</li>
</ol>
<p>&#x524D;4&#x6761;&#x8C03;&#x7528;&#x6307;&#x4EE4;&#x7684;&#x5206;&#x6D3E;&#x903B;&#x8F91;&#x662F;&#x56FA;&#x5316;&#x5728;Java&#x865A;&#x62DF;&#x673A;&#x5185;&#x90E8;&#x7684;&#xFF0C;&#x800C;invokedynamic&#x6307;&#x4EE4;&#x7684;&#x5206;&#x6D3E;&#x903B;&#x8F91;&#x662F;&#x7531;&#x7528;&#x6237;&#x6240;&#x8BBE;&#x5B9A;&#x7684;&#x5F15;&#x5BFC;&#x65B9;&#x6CD5;&#x51B3;&#x5B9A;&#x7684;&#x3002;</p>
<h5 id="2-&#x5206;&#x6D3E;">2. &#x5206;&#x6D3E;</h5>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x7279;&#x5F81;&#xFF1A;&#x7EE7;&#x627F;&#x3001;&#x5C01;&#x88C5;&#x548C;&#x591A;&#x6001;&#x3002;<br>
&#x4E0E;&#x89E3;&#x6790;&#x8C03;&#x7528;&#x6709;&#x5DEE;&#x5F02;&#xFF0C;&#x5206;&#x914D;&#x8C03;&#x7528;&#x53EF;&#x80FD;&#x662F;&#x9759;&#x6001;&#x7684;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x591A;&#x6001;&#x6027;&#x7279;&#x5F81;&#x4E2D;&#x7684;&#x201C;&#x91CD;&#x8F7D;&#x201D;&#x4E0E;&#x201C;&#x91CD;&#x5199;&#x201D;&#x662F;&#x5206;&#x6D3E;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x7684;&#x7ED3;&#x679C;&#x4F53;&#x73B0;&#x3002;</p>
<h6 id="1-&#x9759;&#x6001;&#x5206;&#x6D3E;">1. &#x9759;&#x6001;&#x5206;&#x6D3E;</h6>
<p>&#x91CD;&#x8F7D;&#x6D89;&#x53CA;&#x5230;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x4E0E;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#xFF08;&#x51C6;&#x786E;&#x7684;&#x8BF4;&#x662F;&#x7F16;&#x8BD1;&#x5668;&#xFF09;&#x5728;&#x91CD;&#x8F7D;&#x65F6;&#x662F;&#x901A;&#x8FC7;&#x53C2;&#x6570;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x5224;&#x5B9A;&#x4F9D;&#x636E;&#x7684;&#x3002;&#x5E76;&#x4E14;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x662F;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x77E5;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;
&#x5728;<strong>&#x7F16;&#x8BD1;&#x9636;&#x6BB5;</strong>&#xFF0C;Javac&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x6839;&#x636E;&#x53C2;&#x6570;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x90A3;&#x4E2A;&#x91CD;&#x8F7D;&#x7248;&#x672C;&#xFF0C;&#x4E00;&#x4E2A;&#x5B83;&#x8BA4;&#x4E3A;&#x201C;&#x6700;&#x5408;&#x9002;&#x201D;&#x7684;&#x7248;&#x672C;&#x3002;</p>
<p>&#x6240;&#x6709;&#x4F9D;&#x8D56;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x6765;&#x5B9A;&#x4F4D;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7248;&#x672C;&#x7684;&#x5206;&#x6D3E;&#x52A8;&#x4F5C;&#x79F0;&#x4E3A;&#x9759;&#x6001;&#x5206;&#x6D3E;&#x3002;&#x9759;&#x6001;&#x5206;&#x6D3E;&#x7684;&#x5178;&#x578B;&#x5E94;&#x7528;&#x662F;&#x65B9;&#x6CD5;&#x91CD;&#x8F7D;&#x3002;&#x9759;&#x6001;&#x5206;&#x6D3E;&#x7684;&#x52A8;&#x4F5C;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x662F;&#x7531;&#x865A;&#x62DF;&#x673A;&#x6765;&#x6267;&#x884C;&#x7684;&#x3002;</p>
<p>&#x89E3;&#x6790;&#x4E0E;&#x5206;&#x6D3E;&#x8FD9;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5E76;&#x4E0D;&#x662F;&#x4E8C;&#x9009;&#x4E00;&#x7684;&#x6392;&#x4ED6;&#x5173;&#x7CFB;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x5728;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#x4E0A;&#x53BB;&#x7B5B;&#x9009;&#x3001;&#x786E;&#x5B9A;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6BD4;&#x5982;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x4F1A;&#x5728;&#x7C7B;&#x52A0;&#x8F7D;&#x671F;&#x5C31;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#xFF0C;&#x800C;&#x9759;&#x6001;&#x65B9;&#x6CD5;
&#x663E;&#x7136;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x91CD;&#x8F7D;&#x7248;&#x672C;&#x7684;&#xFF0C;&#x9009;&#x62E9;&#x91CD;&#x8F7D;&#x7248;&#x672C;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x9759;&#x6001;&#x5206;&#x6D3E;&#x5B8C;&#x6210;&#x7684;</p>
<h6 id="2-&#x52A8;&#x6001;&#x5206;&#x6D3E;">2. &#x52A8;&#x6001;&#x5206;&#x6D3E;</h6>
<p>&#x52A8;&#x6001;&#x5206;&#x6D3E;&#x548C;&#x591A;&#x6001;&#x6027;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x4F53;&#x73B0;&#x2014;&#x2014;&#x91CD;&#x5199;&#x6709;&#x7740;&#x5BC6;&#x5207;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>invokevirtual&#x6307;&#x4EE4;&#x7684;&#x5815;&#x80CE;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#xFF1A;<br></p>
<ol>
<li>&#x627E;&#x5230;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x9876;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x6240;&#x6307;&#x5411;&#x5BF9;&#x8C61;&#x7684;<strong>&#x5B9E;&#x9645;&#x7C7B;&#x578B;</strong>&#xFF0C;&#x8BB0;&#x4F5C;C&#x3002;</li>
<li>&#x5982;&#x679C;&#x5728;&#x7C7B;&#x578B;C&#x4E2D;&#x627E;&#x5230;&#x4E0E;&#x5E38;&#x91CF;&#x4E2D;&#x7684;&#x63CF;&#x8FF0;&#x7B26;&#x548C;&#x7B80;&#x5355;&#x540D;&#x79F0;&#x90FD;&#x76F8;&#x7B26;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x6821;&#x9A8C;&#xFF0C;&#x5982;&#x679C;&#x901A;&#x8FC7;&#x5219;&#x8FD4;&#x56DE;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;<strong>&#x76F4;&#x63A5;&#x5F15;&#x7528;</strong>&#xFF0C;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x7ED3;&#x675F;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x901A;&#x8FC7;&#xFF0C;
&#x5219;&#x8FD4;&#x56DE;java.lang.IllegalAccessError&#x5F02;&#x5E38;&#x3002;</li>
<li>&#x5426;&#x5219;&#xFF0C;&#x6309;&#x7167;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x4ECE;&#x4E0B;&#x5F80;&#x4E0A;&#x4F9D;&#x6B21;&#x5BF9;C&#x7684;&#x5404;&#x4E2A;&#x7236;&#x7C7B;&#x8FDB;&#x884C;&#x7B2C;2&#x6B65;&#x7684;&#x641C;&#x7D22;&#x548C;&#x9A8C;&#x8BC1;&#x8FC7;&#x7A0B;&#x3002;</li>
<li>&#x5982;&#x679C;&#x59CB;&#x7EC8;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x629B;&#x51FA;java.lang.AbstractMethodError&#x5F02;&#x5E38;&#x3002;</li>
</ol>
<p>invokevirtual&#x6307;&#x4EE4;&#x628A;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x7684;&#x7C7B;&#x65B9;&#x6CD5;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x89E3;&#x6790;&#x5230;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x786E;&#x5B9A;&#x63A5;&#x6536;&#x8005;&#x7684;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ClassLoad.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 类加载机制">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"JVM字节码执行引擎","level":"1.2.2","depth":2,"previous":{"title":"类加载机制","level":"1.2.1","depth":2,"path":"jvm/ClassLoad.md","ref":"jvm/ClassLoad.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"jvm/JVMBytesCodeEngine.md","mtime":"2019-09-02T13:33:57.113Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-09T14:24:26.379Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

